app/views/books/show.html.erb

      <div class="average-review-rating" data-score=<%=@average_review%>></div>
      <span>Based on <%=@book.reviews.count%> reviews</span>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 17]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 6]]