app/controllers/books_controller.rb

SELECT "categories".* FROM "categories"
SELECT  "books".* FROM "books" ORDER BY "books"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Biography"], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 6], ["LIMIT", 8], ["OFFSET", 0]]
---
	def index
		if params[:category].blank?
		@books = Book.paginate(:page => params[:page], :per_page => 8)
	    else
	    @category_id = Category.find_by(name: params[:category]).id
	    @books = Book.where(:category_id => @category_id).paginate(:page => params[:page], :per_page => 8)

INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "fantasy"], ["description", "asdasd"], ["author", "asdasd"], ["created_at", 2017-04-11 04:20:27 UTC], ["updated_at", 2017-04-11 04:20:27 UTC], ["user_id", 1], ["category_id", 1]]
---
	def create
		@book = current_user.books.build(books_params)
		@book.category_id = params[:category_id]
		if @book.save

UPDATE "books" SET "title" = ?, "description" = ?, "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Rat hay"], ["description", "asdasdasd"], ["author", "asdasd"], ["updated_at", 2017-04-25 11:30:50 UTC], ["id", 6]]
---
	def update
		@book.category_id = params[:category_id]

		if @book.update(books_params)