app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "Good"], ["created_at", 2017-04-24 05:19:24 UTC], ["updated_at", 2017-04-24 05:19:24 UTC], ["user_id", 2], ["book_id", 17]]
---
	def create
		@review = Review.new(review_params)
		@review.book_id = @book.id
		@review.user_id = current_user.id
		if @review.save

UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 2], ["updated_at", 2017-04-24 11:35:07 UTC], ["id", 2]]
---
	def update
		if @review.update(review_params)